3.1 Warm Up Exercises:

1. Sorting and Subsetting:

Dataset for the Task: "titanic.csv"

In [2]:
#1. Load the provided dataset and import in pandas DataFrame.
import pandas as pd
df =pd.read_csv("/content/drive/MyDrive/AI_sem-3/week02-workshop/Datasets/Titanic-Dataset.csv")

In [8]:
#2. Check info of the DataFrame and identify following:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Problem 1 - Sorting:

1. Create a DataFrame called fare that contains only the Fare column of the Titanic dataset. Print the
head of the result.

In [62]:
#dataFrame containing only the fare column
fare = df[['Fare']]
print(fare.head())

      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

2. Create a DataFrame called class age that contains only the Pclass and Age columns of the Titanic
dataset, in that order. Print the head of the result.

In [3]:
class_age=df[['Pclass','Age']] #double brackets is to subset pclass and age columns
print(class_age.head())

   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

3. Create a DataFrame called survived gender that contains the Survived and Sex columns of the
Titanic dataset, in that order.Print the head of the result.

In [4]:
survived_gender=df[['Survived','Sex']]
print(survived_gender.head())

   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

Problem - 2 - Subsetting:
Subsetting Rows:

1. Filter the Titanic dataset for cases where the passenger’s fare is greater than 100, assigning it
to fare gt 100.View the printed result.

In [25]:
fare_gt_100 = df[df['Fare'] > 100]
print(fare_gt_100.head()) # i printed just the head of the data to make it look cleaner

     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1

                                               Name     Sex   Age  SibSp  \
27                   Fortune, Mr. Charles Alexander    male  19.0      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female  28.0      1
88                       Fortune, Miss. Mabel Helen  female  23.0      3
118                        Baxter, Mr. Quigg Edmond    male  24.0      0
195                            Lurette, Miss. Elise  female  58.0      0

     Parch    Ticket      Fare        Cabin Embarked  Fare per Year
27       2     19950  263.0000  C23 C25 C27        S      13.842105
31       0  PC 17569  146.5208          B78        C       5.232886
88       2     19950  263.0000  C23 C25 C27        S      11.434783
118      1  PC 17558  247.5208      B58 B60        C      10.313367
195      0  PC 17569  146.5208          B80        C       2.526221

2. Filter the Titanic dataset for cases where the passenger’s class (Pclass) is 1, assigning it to
first class.View the printed result.

In [63]:
first_class = df[df['Pclass']==1]
print(first_class.head())# i printed just the head of the data to make it look cleaner

    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
11           12         1       1
23           24         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
23                       Sloper, Mr. William Thompson    male  28.0      0

    Parch    Ticket     Fare Cabin Embarked  Fare per Year  Fare per Class  \
1       0  PC 17599  71.2833   C85        C       1.875876         71.2833
3       0    113803  53.1000  C123        S       1.517143         53.1000
6       0     17463  51.8625   E46        S       0.960417         51.8625
11      0    113783  26.5500  C103        S       0.457759         26.5500
23      0    113788  35.5000    A6        S       1.267857         35.5000

   Age Group
1      adult
3      adult
6      adult
11     adult
23     adult

3. Filter the Titanic dataset for cases where the passenger’s age is less than 18 and the passenger
is female (Sex is "female"), assigning it to female under 18. View the printed result.

In [61]:
female_under_18=df[(df['Age']<18) & (df['Sex']=='female')]
print(female_under_18.head())# just the head of the data for cleaner output

    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked  \
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
22  female  15.0      0      0   330923   8.0292   NaN        Q
24  female   8.0      3      1   349909  21.0750   NaN        S

    Fare per Year  Fare per Class Age Group
9        2.147914       15.035400     child
10       4.175000        5.566667     child
14       0.561014        2.618067     child
22       0.535280        2.676400     child
24       2.634375        7.025000     child

Subsetting Rows by Categorical variables:
1. Filter the Titanic dataset for passengers whose Embarked port is either "C" (Cherbourg) or "S"
(Southampton), assigning the result to embarked c or s. View the printed result.

In [27]:
embarked_c_or_s=df[(df['Embarked']=='C') | (df['Embarked']=='S')]
print(embarked_c_or_s.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  Fare per Year
0      0         A/5 21171   7.2500   NaN        S       0.329545
1      0          PC 17599  71.2833   C85        C       1.875876
2      0  STON/O2. 3101282   7.9250   NaN        S       0.304808
3      0            113803  53.1000  C123        S       1.517143
4      0            373450   8.0500   NaN        S       0.230000

2. Filter the Titanic dataset for passengers whose Pclass is in the list [1, 2] (indicating first
or second class), assigning the result to first second class.View the printed result.

In [10]:
first_second_class=df[(df['Pclass']==1) | (df['Pclass']== 2)]
print(first_second_class)

     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
9             10         1       2
11            12         1       1
..           ...       ...     ...
880          881         1       2
883          884         0       2
886          887         0       2
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
3        0            113803  53.1000  C123        S
6        0             17463  51.8625   E46        S
9        0            237736  30.0708   NaN        C
11       0            113783  26.5500  C103        S
..     ...               ...      ...   ...      ...
880      1            230433  26.0000   NaN        S
883      0  C.A./SOTON 34068  10.5000   NaN        S
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
889      0            111369  30.0000  C148        C

[400 rows x 12 columns]

3.2 Exploratory Data Analysis Practice Exercise - 1.

Which passenger had the highest fare paid relative to their age?

---

In [21]:
#handeling missing value in the age column filling them with the median age of the datset before division
df['Age'] = df['Age'].fillna(df['Age'].median())
print(df[['Age']])

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888  28.0
889  26.0
890  32.0

[891 rows x 1 columns]

In [22]:
#1. Add a column to the Titanic dataset, fare per year, containing the fare divided by the age of
# the passenger(i.e., Fare/Age).
df['Fare per Year'] = df['Fare'] / df['Age']
print("After adding the 'fare per year' column:")
print(df[['Fare per Year']])

After adding the 'fare per year' column:
     Fare per Year
0         0.329545
1         1.875876
2         0.304808
3         1.517143
4         0.230000
..             ...
886       0.481481
887       1.578947
888       0.837500
889       1.153846
890       0.242188

[891 rows x 1 columns]

In [18]:
#2. Subset rows where fare per year is higher than 5, assigning this to high fare age.
high_fare_age = df[df['Fare per Year'] > 5]
print("Rows where fare per year is higher than 5:")
print(high_fare_age)

Rows where fare per year is higher than 5:
     PassengerId  Survived  Pclass  \
7              8         0       3
16            17         0       3
27            28         0       1
31            32         1       1
43            44         1       2
..           ...       ...     ...
813          814         0       3
824          825         0       3
827          828         1       2
831          832         1       2
850          851         0       3

                                               Name     Sex    Age  SibSp  \
7                    Palsson, Master. Gosta Leonard    male   2.00      3
16                             Rice, Master. Eugene    male   2.00      4
27                   Fortune, Mr. Charles Alexander    male  19.00      3
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female  28.00      1
43         Laroche, Miss. Simonne Marie Anne Andree  female   3.00      1
..                                              ...     ...    ...    ...
813              Andersson, Miss. Ebba Iris Alfrida  female   6.00      4
824                    Panula, Master. Urho Abraham    male   2.00      4
827                           Mallet, Master. Andre    male   1.00      0
831                 Richards, Master. George Sibley    male   0.83      1
850         Andersson, Master. Sigvard Harald Elias    male   4.00      4

     Parch           Ticket      Fare        Cabin Embarked  Fare per Year
7        1           349909   21.0750          NaN        S      10.537500
16       1           382652   29.1250          NaN        Q      14.562500
27       2            19950  263.0000  C23 C25 C27        S      13.842105
31       0         PC 17569  146.5208          B78        C       5.232886
43       2    SC/Paris 2123   41.5792          NaN        C      13.859733
..     ...              ...       ...          ...      ...            ...
813      2           347082   31.2750          NaN        S       5.212500
824      1          3101295   39.6875          NaN        S      19.843750
827      2  S.C./PARIS 2079   37.0042          NaN        C      37.004200
831      1            29106   18.7500          NaN        S      22.590361
850      2           347082   31.2750          NaN        S       7.818750

[71 rows x 13 columns]

In [19]:
#3. Sort high fare age by descending fare per year, assigning this to high fare age srt.
high_fare_age_srt = high_fare_age.sort_values(by='Fare per Year', ascending=False)
print("Sorted high fare age by descending fare per year:")
print(high_fare_age_srt)

Sorted high fare age by descending fare per year:
     PassengerId  Survived  Pclass  \
305          306         1       1
297          298         0       1
386          387         0       3
164          165         0       3
183          184         1       2
..           ...       ...     ...
348          349         1       3
31            32         1       1
205          206         0       3
813          814         0       3
480          481         0       3

                                               Name     Sex    Age  SibSp  \
305                  Allison, Master. Hudson Trevor    male   0.92      1
297                    Allison, Miss. Helen Loraine  female   2.00      1
386                 Goodwin, Master. Sidney Leonard    male   1.00      5
164                    Panula, Master. Eino Viljami    male   1.00      4
183                       Becker, Master. Richard F    male   1.00      2
..                                              ...     ...    ...    ...
348          Coutts, Master. William Loch "William"    male   3.00      1
31   Spencer, Mrs. William Augustus (Marie Eugenie)  female  28.00      1
205                      Strom, Miss. Telma Matilda  female   2.00      0
813              Andersson, Miss. Ebba Iris Alfrida  female   6.00      4
480                  Goodwin, Master. Harold Victor    male   9.00      5

     Parch      Ticket      Fare    Cabin Embarked  Fare per Year
305      2      113781  151.5500  C22 C26        S     164.728261
297      2      113781  151.5500  C22 C26        S      75.775000
386      2     CA 2144   46.9000      NaN        S      46.900000
164      1     3101295   39.6875      NaN        S      39.687500
183      1      230136   39.0000       F4        S      39.000000
..     ...         ...       ...      ...      ...            ...
348      1  C.A. 37671   15.9000      NaN        S       5.300000
31       0    PC 17569  146.5208      B78        C       5.232886
205      1      347054   10.4625       G6        S       5.231250
813      2      347082   31.2750      NaN        S       5.212500
480      2     CA 2144   46.9000      NaN        S       5.211111

[71 rows x 13 columns]

In [20]:
#4. Select only the Name and fare per year columns of high fare age srt and save the result as result.
result = high_fare_age_srt[['Name', 'Fare per Year']]
print("Selected Name and fare per year columns of high fare age srt:")
print(result)

Selected Name and fare per year columns of high fare age srt:
                                               Name  Fare per Year
305                  Allison, Master. Hudson Trevor     164.728261
297                    Allison, Miss. Helen Loraine      75.775000
386                 Goodwin, Master. Sidney Leonard      46.900000
164                    Panula, Master. Eino Viljami      39.687500
183                       Becker, Master. Richard F      39.000000
..                                              ...            ...
348          Coutts, Master. William Loch "William"       5.300000
31   Spencer, Mrs. William Augustus (Marie Eugenie)       5.232886
205                      Strom, Miss. Telma Matilda       5.231250
813              Andersson, Miss. Ebba Iris Alfrida       5.212500
480                  Goodwin, Master. Harold Victor       5.211111

[71 rows x 2 columns]

Which adult male passenger (age ≥ 18 and Sex is ’male’) paid the highest fare relative to their
class?

In [31]:
#1. Add a column to the Titanic dataset, fare per class, containing the fare divided by the passenger
# class i.e. Fare / Pclass.
df['Fare per Class'] = df['Fare'] / df['Pclass']

In [30]:
#2. Subset rows where the passenger is male (Sex is ”male”) and an adult (Age is greater than or equal
#to 18), assigning this to adult males.
adult_males = df[(df['Sex'] == 'male') & (df['Age'] >= 18)]
print(adult_males.head())

    PassengerId  Survived  Pclass                            Name   Sex   Age  \
0             1         0       3         Braund, Mr. Owen Harris  male  22.0
4             5         0       3        Allen, Mr. William Henry  male  35.0
5             6         0       3                Moran, Mr. James  male  28.0
6             7         0       1         McCarthy, Mr. Timothy J  male  54.0
12           13         0       3  Saundercock, Mr. William Henry  male  20.0

    SibSp  Parch     Ticket     Fare Cabin Embarked  Fare per Year  \
0       1      0  A/5 21171   7.2500   NaN        S       0.329545
4       0      0     373450   8.0500   NaN        S       0.230000
5       0      0     330877   8.4583   NaN        Q       0.302082
6       0      0      17463  51.8625   E46        S       0.960417
12      0      0  A/5. 2151   8.0500   NaN        S       0.402500

    Fare per Class
0         2.416667
4         2.683333
5         2.819433
6        51.862500
12        2.683333

In [34]:
#3. Sort adult males by descending fare per class, assigning this to adult males srt.
adult_males_sr = adult_males.sort_values(by='Fare per Class', ascending=False)
print(adult_males_sr.head())

     PassengerId  Survived  Pclass                                Name   Sex  \
737          738         1       1              Lesurer, Mr. Gustave J  male
679          680         1       1  Cardeza, Mr. Thomas Drake Martinez  male
438          439         0       1                   Fortune, Mr. Mark  male
27            28         0       1      Fortune, Mr. Charles Alexander  male
118          119         0       1            Baxter, Mr. Quigg Edmond  male

      Age  SibSp  Parch    Ticket      Fare        Cabin Embarked  \
737  35.0      0      0  PC 17755  512.3292         B101        C
679  36.0      0      1  PC 17755  512.3292  B51 B53 B55        C
438  64.0      1      4     19950  263.0000  C23 C25 C27        S
27   19.0      3      2     19950  263.0000  C23 C25 C27        S
118  24.0      0      1  PC 17558  247.5208      B58 B60        C

     Fare per Year  Fare per Class
737      14.637977        512.3292
679      14.231367        512.3292
438       4.109375        263.0000
27       13.842105        263.0000
118      10.313367        247.5208

In [35]:
#4. Select only the Name, Age, and fare per class columns of adult males sr and save the result
#as result.
result = adult_males_sr[['Name', 'Age', 'Fare per Class']]
print(result)

                                   Name   Age  Fare per Class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
438                   Fortune, Mr. Mark  64.0        263.0000
27       Fortune, Mr. Charles Alexander  19.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208
..                                  ...   ...             ...
806              Andrews, Mr. Thomas Jr  39.0          0.0000
481    Frost, Mr. Anthony Wood "Archie"  28.0          0.0000
413      Cunningham, Mr. Alfred Fleming  28.0          0.0000
466               Campbell, Mr. William  28.0          0.0000
271        Tornquist, Mr. William Henry  25.0          0.0000

[519 rows x 3 columns]

3.3 Exploratory Data Analysis with Group-by Method Practice Exercise:

What percent of the total fare revenue came from each passenger class?

In [36]:
#1. Calculate the total Fare paid across all passengers in the Titanic dataset.
total_fare = df['Fare'].sum()
print(total_fare)

28693.9493

In [37]:
#2. Subset for passengers in first class (Pclass is 1) and calculate their total fare.
first_class_fare = df[df['Pclass'] == 1]['Fare'].sum()
print(first_class_fare)

18177.4125

In [41]:
#3. Do the same for second class (Pclass is 2) and third class (Pclass is 3).
second_class_fare = df[df['Pclass'] == 2]['Fare'].sum()
print(second_class_fare)

3801.8417

In [39]:
third_class_fare = df[df['Pclass'] == 3]['Fare'].sum()
print(third_class_fare)

6714.6951

In [42]:
#4. Combine the fare totals from first, second, and third classes into a list.
fare_totals = [first_class_fare, second_class_fare, third_class_fare]
print(fare_totals)

[18177.4125, 3801.8417, 6714.6951]

In [44]:
#5. Divide the totals for each class by the overall total fare to get the proportion of fare revenue by class.
first_class_percent = (first_class_fare / total_fare) * 100
second_class_percent = (second_class_fare / total_fare) * 100
third_class_percent = (third_class_fare / total_fare) * 100
print(first_class_percent, second_class_percent, third_class_percent)

63.349287718996564 13.24962855496507 23.401083726038365

What percent of the total number of passengers on the Titanic belonged to each age group
(e.g., child, adult, senior)?

In [52]:
#1. Create a new column, age group, that categorizes passengers into "child" (age < 18), "adult" (age
# 18{64), and "senior" (age 65 and above).
df['Age Group'] = ['child' if age < 18 else 'adult' if age < 65 else 'senior' for age in df['Age']]
print(df[['Age Group']])

    Age Group
0       adult
1       adult
2       adult
3       adult
4       adult
..        ...
886     adult
887     adult
888     adult
889     adult
890     adult

[891 rows x 1 columns]

In [53]:
#2. Calculate the total number of passengers on the Titanic.
total_passengers = df['Age'].count()
print(total_passengers)

891

In [54]:
#3. Count the number of passengers in each age group.
age_group_counts = df['Age Group'].value_counts()
print(age_group_counts)

Age Group
adult     767
child     113
senior     11
Name: count, dtype: int64

In [59]:
#4. Divide the count of each age group by the total number of passengers to get the proportion of passengers
# in each age group.
age_group_proportions = age_group_counts / total_passengers
print(age_group_proportions)

Age Group
adult     0.860831
child     0.126824
senior    0.012346
Name: count, dtype: float64

In [60]:
#5. Display the proportion as a percentage.
age_group_percentage = age_group_proportions * 100
print(age_group_percentage)

Age Group
adult     86.083053
child     12.682379
senior     1.234568
Name: count, dtype: float64